systemtest/testcases_services/test_wcs/queries/224-describe_coverage_soap.error.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap-env:Envelope
	xmlns:soap-env="http://www.w3.org/2003/05/soap-envelope">
	<soap-env:Body>
		<wcs:DescribeCoverage
			xmlns:wcs="http://www.opengis.net/wcs/2.0"
			xmlns:tems="java:com.occamlab.te.web.MonitorServlet"
			xmlns:gml="http://www.opengis.net/gml/3.2"
			xmlns:ows="http://www.opengis.net/ows/2.0"
			xmlns:wcseo="http://www.opengis.net/wcseo/1.0"
			xmlns:saxon="http://saxon.sf.net/"
			xmlns:xhtml="http://www.w3.org/1999/xhtml"
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
			xmlns:gen="java:com.occamlab.te.Generator"
			xmlns:te="http://www.occamlab.com/te"
			xmlns:xi="http://www.w3.org/2001/XInclude"
			xmlns:tec="java:com.occamlab.te.TECore"
			xmlns:sch="http://purl.oclc.org/dsdl/schematron"
			xmlns:ctl="http://www.occamlab.com/ctl"
			xmlns:ctlp="http://www.occamlab.com/te/parsers"
			xmlns:xs="http://www.w3.org/2001/XMLSchema"
			xmlns:wcs2="http://www.opengis.net/wcs/2.0"
			xmlns:xlink="http://www.w3.org/1999/xlink" service="WCS" version="2.0.1" xsi:schemaLocation="http://www.opengis.net/wcs/2.0 http://schemas.opengis.net/wcs/2.0/wcsAll.xsd">
			<wcs:Coverage>test_mean_summer_airtemp</wcs:Coverage>
		</wcs:DescribeCoverage>
	</soap-env:Body>
</soap-env:Envelope>
