petascope/xml/ogc/wcs/2.0.0/examples/discreteGridPointCoverage/requestGetCapabilities-SOAP.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"> 
    <env:Header/>
    <env:Body>
        <wcs:GetCapabilities  xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
            xmlns:ows='http://www.opengis.net/ows/2.0'
            xmlns:wcs='http://www.opengis.net/wcs/2.0'
            xsi:schemaLocation='http://www.opengis.net/wcs/2.0 ../../wcsAll.xsd'
            service="WCS">
            <ows:AcceptVersions>
                <ows:Version>2.0</ows:Version>
            </ows:AcceptVersions>
        </wcs:GetCapabilities>
    </env:Body>
</env:Envelope>
