resources/WCS/2.0/test/soapDescribeCoverage_01.xml

<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope" >
    <Body>
        <DescribeCoverage xmlns="http://www.opengis.net/wcs/2.0"  service="WCS" version="2.0">
            <Identifier>S1/opendap/ioos/200803061600_HFRadar_USEGC_6km_rtv_SIO.ncml</Identifier>
        </DescribeCoverage>
    </Body>
</Envelope>
