resources/WCS/2.0/test/soapGetCapabilities_01.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope" >
    <Body>
        <GetCapabilities xmlns="http://www.opengis.net/wcs/2.0"  service="WCS"/>
    </Body>
</Envelope>
