applications/petascope/src/test/java/testdata/DescribeCoverage-SOAP.in

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"> 
    <env:Header/>
    <env:Body>
        <wcs:DescribeCoverage  xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
            xmlns:wcs='http://www.opengis.net/wcs/2.0'
            xmlns:gml='http://www.opengis.net/gml/3.2'
            xsi:schemaLocation='http://www.opengis.net/wcs/2.0 ../../wcsAll.xsd'
            service="WCS" version="2.0.0">
            <wcs:CoverageId>mr2</wcs:CoverageId>
        </wcs:DescribeCoverage>
    </env:Body>
</env:Envelope>
